Bocha91/SK6805_EFM32GG/Drivers/rtcdriver.c
/// @cond DO_NOT_INCLUDE_WITH_DOXYGEN

#if defined(RTCDRV_USE_RTC)
void RTC_IRQHandler(void)
#elif defined(RTCDRV_USE_RTCC)
void RTCC_IRQHandler(void)
#endif
{
  CORE_DECLARE_IRQ_STATE;
  uint32_t flags, timeElapsed, cnt, timeToNextTimerCompletion;

  CORE_ENTER_ATOMIC();

  // CNT will normally be COMP0+1 at this point,
  // unless IRQ latency exceeded one tick period.

  flags = RTC_INTGET();

  // Acknowledge all RTC interrupts that are enabled which aren't processed
  // below to prevent looping in the IRQ handler if these become enabled
  RTC_INTCLEAR(flags & ~(RTC_COMP_INT | RTC_OF_INT));

  if ( flags & RTC_COMP_INT ) {
    // Stop timer system by disabling the compare IRQ.
    // Update all timers with the time elapsed, call callbacks if needed,
    // then find the timer with the shortest timeout (if any at all) and
    // reenable the compare IRQ if needed.

    inTimerIRQ = true;

    cnt = RTC_COUNTERGET();

    // This loop is repeated if CNT is incremented while processing.
    do {
      RTC_INTDISABLE(RTC_COMP_INT);

      timeElapsed = TIMEDIFF(cnt, lastStart);

      // Update all timers with elapsed time.
      checkAllTimers(timeElapsed);

      // Execute timer callbacks.
      executeTimerCallbacks();

      // Restart RTC according to next timeout.
      rescheduleRtc(cnt);

      cnt = RTC_COUNTERGET();
      timeElapsed = TIMEDIFF(cnt, lastStart);
      timeToNextTimerCompletion = TIMEDIFF(RTC_COMPAREGET(), lastStart);
      /* If the counter has passed the COMP(ARE) register value since we
         checked the timers, then we should recheck the timers and reschedule
         again. */
    } while ( rtcRunning && (timeElapsed > timeToNextTimerCompletion));
    inTimerIRQ = false;
  }

#if defined(EMDRV_RTCDRV_WALLCLOCK_CONFIG)
  if ( flags & RTC_OF_INT ) {
    RTC_INTCLEAR(RTC_OF_INT);
    wallClockOverflowCnt++;
  }
#endif

  CORE_EXIT_ATOMIC();
}

static void checkAllTimers(uint32_t timeElapsed)
{
  int i;
#if defined(EMODE_DYNAMIC)
  int numOfTimersRunning = 0;
#endif

  // Iterate through the timer table.
  // Update time remaining, check for timeout and rescheduling of periodic
  // timers, check for callbacks.

  for ( i = 0; i < EMDRV_RTCDRV_NUM_TIMERS; i++ ) {
    timer[i].doCallback = false;
    if ( timer[i].running == true ) {
#if defined(EMODE_DYNAMIC)
      numOfTimersRunning++;
#endif
      if ( timer[i].remaining > timeElapsed ) {
        timer[i].remaining -= timeElapsed;
      } else {
        if ( timer[i].timerType == rtcdrvTimerTypeOneshot ) {
          timer[i].running = false;
#if defined(EMODE_DYNAMIC)
          numOfTimersRunning--;
#endif
        } else {
          // Compensate overdue periodic timers to avoid accumlating errors.
          // Note that in some cases the timer can be held up more than twice the time
          // of the periodic timer. This can happen on flash erase for instance or
          // when long interrupt handlers are blocking the RTC interrupt.
          uint64_t previousTick = timeElapsed - timer[i].remaining;
          timer[i].remaining = timer[i].ticks - (previousTick % timer[i].ticks);

          if ( timer[i].periodicCompensationUsec > 0 ) {
            timer[i].periodicDriftUsec += timer[i].periodicCompensationUsec;
            if (timer[i].periodicDriftUsec >= TICK_TIME_USEC) {
              // Add a tick if the timer drift is longer than the time of
              // one tick.
              timer[i].remaining += 1;
              timer[i].periodicDriftUsec -= TICK_TIME_USEC;
            }
          } else {
            timer[i].periodicDriftUsec -= timer[i].periodicCompensationUsec;
            if (timer[i].periodicDriftUsec >= TICK_TIME_USEC) {
              // Subtract one tick if the timer drift is longer than the time
              // of one tick.
              timer[i].remaining -= 1;
              timer[i].periodicDriftUsec -= TICK_TIME_USEC;
            }
          }
        }
        if ( timer[i].callback != NULL ) {
          timer[i].doCallback = true;
        }
      }
    }
  }

#if defined(EMODE_DYNAMIC)
  // If no timers are running, we can remove block on EM3 and EM4 sleep modes.
  if ( (numOfTimersRunning == 0) && (sleepBlocked == true) ) {
    sleepBlocked = false;
    SLEEP_SleepBlockEnd(sleepEM3);
  }
#endif
}

static void delayTicks(uint32_t ticks)
{
  uint32_t startTime;
  volatile uint32_t now;

  if ( ticks ) {
    startTime = RTC_COUNTERGET();
    do {
      now = RTC_COUNTERGET();
    } while ( TIMEDIFF(now, startTime) < ticks );
  }
}

static void executeTimerCallbacks(void)
{
  int i;

  for ( i = 0; i < EMDRV_RTCDRV_NUM_TIMERS; i++ ) {
    if ( timer[i].doCallback ) {
      timer[i].callback(i, timer[i].user);
    }
  }
}

static void rescheduleRtc(uint32_t rtcCnt)
{
  int i;
  uint64_t min = UINT64_MAX;

  // Find the timer with shortest timeout.
  for ( i = 0; i < EMDRV_RTCDRV_NUM_TIMERS; i++ ) {
    if (    (timer[i].running   == true)
            && (timer[i].remaining <  min) ) {
      min = timer[i].remaining;
    }
  }

  rtcRunning = false;
  if ( min != UINT64_MAX ) {
    min = SL_MIN(min, RTC_CLOSE_TO_MAX_VALUE);
#if defined(RTCDRV_USE_RTC)
    if ( inTimerIRQ == false ) {
      lastStart = (rtcCnt) & RTC_COUNTER_MASK;
    } else
#endif
    {
      lastStart = rtcCnt;
    }
    RTC_INTCLEAR(RTC_COMP_INT);

    RTC_COMPARESET(rtcCnt + min);

#if defined(EMODE_DYNAMIC)
    // When RTC is running, we can not allow EM3 or EM4.
    if ( sleepBlocked == false ) {
      sleepBlocked = true;
      SLEEP_SleepBlockBegin(sleepEM3);
    }
#endif

    rtcRunning = true;

    // Reenable compare IRQ.
    RTC_INTENABLE(RTC_COMP_INT);
  }
}
/// @endcond

/* *INDENT-OFF* */
/******** THE REST OF THE FILE IS DOCUMENTATION ONLY !**********************//**
 * @addtogroup emdrv
 * @{
 * @addtogroup RTCDRV
 * @brief Real-time Clock Driver
 * @{

   @details
   The source files for the RTCDRV device driver library resides in the
   emdrv/rtcdrv folder, and are named rtcdriver.c and rtcdriver.h.

   @li @ref rtcdrv_intro
   @li @ref rtcdrv_conf
   @li @ref rtcdrv_api
   @li @ref rtcdrv_example

   @n @section rtcdrv_intro Introduction

   The RTCDRV driver use the RTC peripheral of a device in Silicon Laboratories
   Gecko microcontroller family to provide a user configurable number of software
   millisecond timers.
   Two kinds of timers are supported; oneshot timers and periodic timers.
   Timers will, when their timeout period has expired, call a user supplied
   callback function.
   @note The callback function is called from within an interrupt handler with
   interrupts disabled.

   In addition to the timers, RTCDRV also offers an optional wallclock
   functionality. The wallclock keeps track of the number of seconds elapsed
   since RTCDRV was initialized.

   RTCDRV resolution is 1 ms with 244 us accuracy. On the EFM32G family (classic
   Gecko's) the accuracy is 61 us.
   Since RTCDRV is interrupt driven using the default RTC interrupt priority
   level, timeout accuracy will be affected by the interrupt latency of the
   system.

   @n @section rtcdrv_conf Configuration Options

   Some properties of the RTCDRV driver are compile-time configurable. These
   properties are stored in a file named @ref rtcdrv_config.h. A template for this
   file, containing default values, resides in the emdrv/config folder.
   Currently the configuration options are:
   @li The number of timers that RTCDRV provides.
   @li Inclusion of the wallclock functionality.
   @li Integration with SLEEP driver.

   When integration with the SLEEP driver is enabled, RTCDRV will keep the
   SLEEP driver updated with regards to which energy mode that can be
   safely used.

   To configure RTCDRV, provide your own configuration file. Here is a
   sample @ref rtcdrv_config.h file:
   @verbatim
#ifndef SILICON_LABS_RTCDRV_CONFIG_H
#define SILICON_LABS_RTCDRV_CONFIG_H

// Define how many timers RTCDRV provide.
#define EMDRV_RTCDRV_NUM_TIMERS     (4)

